; domain
(define (domain blocks-world)
	(:requirements :typing)
	(:types block gripper table)
	(:predicates
		(empty ?g - gripper)
		(clear ?b - block)
		(stacked ?a - block ?b - block)
		(on-table ?a - block ?b - table)
		(in-gripper ?b - block ?g - gripper)
	)
	(:action unstack
		:parameters (?g - gripper ?b - block ?c - block)
		:precondition (and
			(clear ?b)
			(empty ?g)
			(stacked ?b ?c)
		)
		:effect (and
			(not (stacked ?b ?c))
			(in-gripper ?b ?g)
			(clear ?c)
			)
	)
	(:action stack
		:parameters (?g - gripper ?b - block ?c - block)
		:precondition (and
			(in-gripper ?b ?g)
			(clear ?c)
		)
		:effect (and
			(stacked ?b ?c)
			(not (clear ?c))
			(not (in-gripper ?b ?g))
			)
	)
	(:action grab-from-table
		:parameters (?g - gripper ?b - block ?c - table)
		:precondition (and
			(clear ?b)
			(empty ?g)
			(on-table ?b ?c)
		)
		:effect (and
			(not (on-table ?b ?c))
			(in-gripper ?b ?g)
			)
	)
	(:action place-on-table
		:parameters (?g - gripper ?b - block ?t - table)
		:precondition (and
			(in-gripper ?b ?g)
    	)
		:effect (and
			(on-table ?b ?t)
			(clear ?b)
			(empty ?g)
			(not (in-gripper ?b ?g))
		)
	)	
)

; problem
(define (problem blocks-world-a)
	(:domain blocks-world)
	(:objects block_a - block block_b - block block_c - block gripper_a - gripper table_a - table)
	(:init
		(on-table block_a table_a)
		(on-table block_c table_a)
		(stacked block_b block_a)
		(empty gripper_a)
		(clear block_b)
		(clear block_c)
	)
	(:goal
		(and
			(stacked block_b block_c)
			(stacked block_a block_b)
		)
	)
)

; plan
1. (unstack gripper_a block_b block_a)
   deleted: (stacked block_b block_a)
   added: (in-gripper block_b gripper_a) (clear block_a)
   goals met: 0 of 2
2. (grab-from-table gripper_a block_a table_a)
   deleted: (on-table block_a table_a)
   added: (in-gripper block_a gripper_a)
   goals met: 0 of 2
3. (stack gripper_a block_a block_b)
   deleted: (clear block_b) (in-gripper block_a gripper_a)
   added: (stacked block_a block_b)
   goals met: 1 of 2
4. (stack gripper_a block_b block_c)
   deleted: (clear block_c) (in-gripper block_b gripper_a)
   added: (stacked block_b block_c)
   goals met: 2 of 2
